# Ghost-CA-YOLO for road-damage detection.
# Based on the YOLO11s detection topology with Ghost bottlenecks and
# Coordinate Attention at P3/P4/P5 feature outputs.

nc: 4
scale: s
scales:
  n: [0.50, 0.25, 1024]
  s: [0.50, 0.50, 1024]
  m: [0.50, 1.00, 512]
  l: [1.00, 1.00, 512]
  x: [1.00, 1.50, 512]

backbone:
  - [-1, 1, Conv, [64, 3, 2]]
  - [-1, 1, Conv, [128, 3, 2]]
  - [-1, 2, C3Ghost, [256, False]]
  - [-1, 1, Conv, [256, 3, 2]]
  - [-1, 2, C3Ghost, [512, False]]
  - [-1, 1, Conv, [512, 3, 2]]
  - [-1, 2, C3Ghost, [512, True]]
  - [-1, 1, Conv, [1024, 3, 2]]
  - [-1, 2, C3Ghost, [1024, True]]
  - [-1, 1, SPPF, [1024, 5]]
  - [-1, 2, C2PSA, [1024]]

head:
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 6], 1, Concat, [1]]
  - [-1, 2, C3Ghost, [512, False]]

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 4], 1, Concat, [1]]
  - [-1, 2, C3Ghost, [256, False]]
  - [-1, 1, CoordAtt, [128]]

  - [-1, 1, Conv, [256, 3, 2]]
  - [[-1, 13], 1, Concat, [1]]
  - [-1, 2, C3Ghost, [512, False]]
  - [-1, 1, CoordAtt, [256]]

  - [-1, 1, Conv, [512, 3, 2]]
  - [[-1, 10], 1, Concat, [1]]
  - [-1, 2, C3Ghost, [1024, True]]
  - [-1, 1, CoordAtt, [512]]

  - [[17, 21, 25], 1, Detect, [nc]]
